Rokasbarasa1/STM32-Quadcopter/src/main.c
/* Auto generated shit -----------------------------------------------*/
#include "main.h"


I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi3;
DMA_HandleTypeDef hdma_spi3_tx;

TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart2_rx;


void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI1_Init(void);
static void MX_SPI3_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);
/* Actual functional code -----------------------------------------------*/

#include "../lib/printf/retarget.h"
#include "stdio.h"
#include "string.h"
#include "math.h"

// Drivers
#include "../lib/mpu6050/mpu6050.h"
#include "../lib/qmc5883l/qmc5883l.h"
#include "../lib/mmc5603/mmc5603.h"

#include "../lib/bmp280/bmp280.h"
#include "../lib/bn357/bn357.h"
#include "../lib/nrf24l01/nrf24l01.h"
#include "../lib/sd_card/sd_card_spi.h"
#include "../lib/betaflight_blackbox_wrapper/betaflight_blackbox_wrapper.h"

// Other imports
#include "../lib/utils/ned_coordinates/ned_coordinates.h"
#include "../lib/pid/pid.h"
#include "../lib/filtering/filtering.h"
#include "../lib/kalman_filter/kalman_filter.h"
#include "../lib/utils/matrix_operations/matrix_operations.h"
#include "../lib/bdshot600/bdshot600.h"

#ifndef M_PI
#define M_PI (3.14159265358979323846)
#endif

void init_STM32_peripherals();
void calibrate_escs();
uint16_t setServoActivationPercent(float percent, uint16_t minValue, uint16_t maxValue);
float mapValue(float value, float input_min, float input_max, float output_min, float output_max);
void extract_request_values(char *request, uint8_t request_size, uint8_t *throttle, uint8_t *yaw, uint8_t *pitch, uint8_t *roll);
float get_sensor_fusion_altitude(float gps_altitude, float barometer_altitude);
u_int8_t init_drivers();
void check_calibrations();
void calibrate_gyro();
void get_initial_position();
void handle_loop_timing();
void reset_array_data(float *array, uint8_t array_size);

void extract_joystick_request_values_uint(char *request, uint8_t request_size, uint8_t *throttle, uint8_t *yaw, uint8_t *roll, uint8_t *pitch);
void extract_joystick_request_values_float(char *request, uint8_t request_size, float *throttle, float *yaw, float *roll, float *pitch);
void extract_request_type(char *request, uint8_t request_size, char *type_output);
void extract_pid_request_values(char *request, uint8_t request_size, float *added_proportional, float *added_integral, float *added_derivative, float *added_master);
void extract_accelerometer_offsets(char *request, uint8_t request_size, float *added_x_axis_offset, float *added_y_axis_offset);
void track_time();
float map_value(float value, float input_min, float input_max, float output_min, float output_max);
float apply_dead_zone(float value, float max_value, float min_value, float dead_zone);
void send_pid_base_info_to_remote();
void send_pid_added_info_to_remote();
char* generate_message_pid_values_nrf24(float base_proportional, float base_integral, float base_derivative, float base_master);
void extract_flight_mode(char *request, uint8_t request_size, uint8_t *new_flight_mode);
void switch_x_and_y_axis(float *data);
void invert_axies(float *data);
float sawtooth_sin(float x_radian);
float sawtooth_cos(float x_radian);
float triangle_wave(float x);
float triangle_sin(float x);
float triangle_cos(float x);

void handle_get_and_calculate_sensor_values();
void handle_radio_communication();
void handle_logging();
void handle_pid_and_motor_control();
void setup_logging_to_sd(uint8_t use_updated_file_name);
void handle_pre_loop_start();
void handle_loop_start();
void handle_loop_end();
uint64_t get_absolute_time();
void initialize_control_abstractions();
void set_flight_mode(uint8_t mode);
void initialize_motor_communication();

// PWM pins
// PA8  - 1 TIM1 for motor back-left (BL)
// PA11 - 4 TIM1 for motor back right (BR)
// PA0  - 1 TIM2 for motor front right (FR)
// PA1  - 2 TIM2 for motor front left (FL)

// UART pins
// PA2  UART2 tx GPS
// PA3  UART2 rx GPS
// PA10 UART1 rx FTDI
// PA9  UART1 tx FTDI

// I2C pins
// PB7  I2C1 SDA
// PB6  I2C1 SCL

// GPIO
// PC13 Internal LED
// PA12 LED

// SPI3 SD card logger
// PB5 MOSI
// PB4 MISO
// PB3 SCK
// PA15 CS
// PA12 Slave ready. Falling interrupt

// SPI1 Radio module
// PA5 SCK
// PA6 MISO
// PA7 MOSI
// PB1 CS 
// PB0 CE

// ------------------------------------------------------------------------------------------------------ Refresh rate
// Nyquist: sampling frequency must be at least double that of the highest frequency of interest
// The MPU6050 has a lowpass set to 260Hz we need to be able to manipulate all the frequencies until that. So 260 * 2 = 520
#define REFRESH_RATE_HZ 520

const uint16_t precalculated_timing_miliseconds = (1000000 / REFRESH_RATE_HZ);
// ------------------------------------------------------------------------------------------------------ handling loop timing
uint32_t loop_start_time = 0;
uint32_t loop_end_time = 0;
int16_t delta_loop_time = 0;

// Timing
uint64_t absolute_microseconds_since_start = 0;
uint16_t loop_start_microseconds = 0; // The timer is only 16 bits
uint16_t loop_start_miliseconds = 0; // Fallback if the microseconds overflew
uint16_t loop_end_microseconds = 0;
int32_t loop_delta_microseconds = 0;

// Keep track of time in each loop. Since loop start
uint32_t startup_time_microseconds = 0;
uint32_t delta_time = 0;
uint16_t time_since_startup_ms = 0;
uint8_t time_since_startup_minutes = 0;
uint8_t time_since_startup_seconds = 0;
uint8_t time_since_startup_hours = 0;

uint8_t entered_loop = 0;

// ------------------------------------------------------------------------------------------------------ Motor settings
const uint32_t dshot_refresh_rate = 550; // Hz

#define max_dshot600_throttle_value 2047
#define min_dshot600_throttle_value 48

#define max_dshot600_command_value 47
#define min_dshot600_command_value 1

#define dshot600_neutral_value 0
#define actual_min_dshot600_throttle_value 91 // Lowest value that lets the motors spin freely and at low rpm
// Take 75 percent of max because my battery can't handle all that current.
const uint16_t actual_max_dshot600_throttle_value = min_dshot600_throttle_value + ((max_dshot600_throttle_value - min_dshot600_throttle_value) * 75) / 100; // (max lipo amp rating / max draw of a bldc motor being used x 4) 0.917 * (max_pwm - min_pwm) + min_pwm = 371.4

// Motor 0 - BL, 1 - BR, 2 - FR, 3 - FL
float motor_power[] = {0.0, 0.0, 0.0, 0.0}; // Percent
float motor_frequency[] = {0.0, 0.0, 0.0, 0.0};
float motor_rpm[] = {0.0, 0.0, 0.0, 0.0};

// Motor handles
uint8_t motor_BL;
uint8_t motor_BR;
uint8_t motor_FR;
uint8_t motor_FL;

// For calculations
uint16_t throttle_value_FR;
uint16_t throttle_value_FL;
uint16_t throttle_value_BL;
uint16_t throttle_value_BR;

// Used by the bdshot600 protocol for all the motors
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim){
    if(htim->Instance == TIM3){
        bdshot600_send_all_motor_data();
        // printf("dshot600\n");
        // dshot600_send_all_motor_data();
    }
}

// ------------------------------------------------------------------------------------------------------ Sensor calibrations

