Rokasbarasa1/STM32-Quadcopter/src/main.c
float roll_effect_on_lat = 0;
float pitch_effect_on_lat = 0;

float roll_effect_on_lon = 0;
float pitch_effect_on_lon = 0;

// ------------------------------------------------------------------------------------------------------ Sensor fusion and filtering stuff
float complementary_ratio = 1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ)); // Depends on how often the loop runs. 1 second / (1 second + one loop time)
float complementary_beta = 0.0;

float filtering_magnetometer_cutoff_frequency = 180; // 200Hz sample rate and 0.85 alpha gives 180Hz cutoff and around 1ms delay
float filtering_accelerometer_cutoff_frequency = 40; // 200Hz sample rate and 0.386 alpha gives 20Hz cutoff and around 1ms delay

struct low_pass_filter filter_magnetometer_x;
struct low_pass_filter filter_magnetometer_y;
struct low_pass_filter filter_magnetometer_z;

struct low_pass_filter filter_accelerometer_x;
struct low_pass_filter filter_accelerometer_y;
struct low_pass_filter filter_accelerometer_z;

struct kalman_filter altitude_and_velocity_kalman;
// ------------------------------------------------------------------------------------------------------ Remote control settings
float max_yaw_attack = 40.0;
float max_roll_attack = 10;
float max_pitch_attack = 10;
float roll_attack_step = 0.2;
float pitch_attack_step = 0.2;
float max_throttle_vertical_velocity = 30; // cm/second

float throttle = 0.0;
float yaw = 50.0;
float last_yaw = 50.0;
float pitch = 50.0;
float roll = 50.0;

float minimum_signal_timing_seconds = 0.2; // Seconds
uint64_t last_signal_timestamp_microseconds = 0;

// ------------------------------------------------------------------------------------------------------ Logging to SD card
char log_file_base_name[] = "Quadcopter.txt";
char log_file_blackbox_base_name[] = "Quadcopter.BBL";
char *new_log_file_blackbox_base_name;
uint16_t file_index = 0;

uint8_t sd_card_initialized = 0;
uint8_t log_loop_count = 0;
uint8_t sd_card_async = 0;
const uint8_t use_simple_async = 0; // 0 is the complex async
const uint8_t use_blackbox_logging = 1; 

// ------------------------------------------------------------------------------------------------------ Stuff for blackbox logging
uint32_t loop_iteration = 1;
float PID_proportional[3];
float PID_integral[3];
float PID_derivative[2];
float PID_feed_forward[3];
float PID_set_points[4];
float remote_control[4];

// ------------------------------------------------------------------------------------------------------ Flight mode settings
// Flight modes:
// (0) - acro
// (1) - angle
// (2) - angle with altitude hold
// (3) - angle with altitude hold and gps hold
// (4) - angle with gps hold and without ltitude hold

uint8_t flight_mode = 0;

uint8_t use_angle_mode = 0;
uint8_t use_vertical_velocity_control = 0;
uint8_t use_gps_hold = 0;


uint32_t radio = 0;
uint32_t radio2 = 0;
uint32_t sensors = 0;
uint32_t sensors2 = 0;
uint32_t sensors3 = 0;
uint32_t sensors4 = 0;
uint32_t sensors5 = 0;
uint32_t sensors6 = 0;
uint32_t sensors7 = 0;

uint32_t motor = 0;
uint32_t logging = 0;
uint32_t logging2 = 0;
uint32_t logging3 = 0;



int main(void){
    init_STM32_peripherals();
    accelerometer_roll_offset = base_accelerometer_roll_offset;
    accelerometer_pitch_offset = base_accelerometer_pitch_offset;
    // Turn off the blue led. Will show the status of sd logging later
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    printf("STARTING PROGRAM\n"); 
    

    
    if(init_drivers() == 0) return 0; // exit if initialization failed


    HAL_Delay(2000); // Dont want to interfere in calibration

    set_flight_mode(flight_mode);
    // check_calibrations();
    calibrate_gyro(); // Recalibrate the gyro as the temperature affects the calibration
    get_initial_position();
    // setup_logging_to_sd(0);
    initialize_control_abstractions();
    initialize_motor_communication();

    handle_pre_loop_start();
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;  
    DWT->CYCCNT = 0;                                // Reset the cycle counter
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    while (1){
        // Get current time
        handle_loop_start();

        
        DWT->CYCCNT = 0;
        radio = DWT->CYCCNT;
        handle_radio_communication();
        // printf("r%lu\n", DWT->CYCCNT - radio);
        // printf("2r%lu\n", radio2 - radio);

        sensors = DWT->CYCCNT;
        handle_get_and_calculate_sensor_values(); // Important do do this right before the pid stuff.
        // printf("1s%lu\n", DWT->CYCCNT - sensors);
        // printf("2s%lu\n", sensors2 - sensors);
        // printf("3s%lu\n", sensors3 - sensors);
        // printf("4s%lu\n", sensors4 - sensors);
        // printf("5s%lu\n", sensors5 - sensors);
        // printf("6s%lu\n", sensors6 - sensors);
        // printf("7s%lu\n", sensors7 - sensors);

        motor = DWT->CYCCNT;
        handle_pid_and_motor_control();
        // printf("m%lu\n", DWT->CYCCNT - motor);

        logging = DWT->CYCCNT;
        handle_logging();
        // printf("1L%lu\n", DWT->CYCCNT - logging);
        // printf("2L%lu\n", logging2 - logging);
        // printf("3L%lu\n", logging3 - logging);

        handle_loop_end();
    }
}

uint8_t init_drivers(){
    printf("-----------------------------INITIALIZING MODULES...\n");

    uint8_t mpu6050 = init_mpu6050(
        &hi2c1, 
        ACCEL_CONFIG_RANGE_2G, 
        GYRO_CONFIG_RANGE_500_DEG, 
        // LOW_PASS_FILTER_FREQUENCY_CUTOFF_GYRO_21HZ_ACCEL_20HZ,
        LOW_PASS_FILTER_FREQUENCY_CUTOFF_GYRO_260HZ_ACCEL_256HZ,
        1, 
        accelerometer_scale_factor_correction, 
        accelerometer_correction, 
        gyro_correction, 
        REFRESH_RATE_HZ, 
        complementary_ratio, 
        complementary_beta
    );

    uint8_t mmc5603 = mmc5603_init(&hi2c1, 1, magnetometer_hard_iron_correction, magnetometer_soft_iron_correction, 1, 200, 1);
    uint8_t bmp280 = init_bmp280(&hi2c1);
    uint8_t bn357 = init_bn357(&huart2, &hdma_usart2_rx, 1);
    uint8_t nrf24 = init_nrf24(&hspi1);

    printf("-----------------------------INITIALIZING MODULES DONE... ");

    if (mpu6050 && mmc5603 && bmp280 && bn357 && nrf24){
        printf("OK\n");
    }else{
        printf("NOT OK\n");
        return 0;
    }

    // Continue initializing
    nrf24_rx_mode(tx_address, 10);
    // bn357_start_uart_interrupt();

    return 1;
}

void handle_get_and_calculate_sensor_values(){
    // ------------------------------------------------------------------------------------------------------ Reset
    // Reset the values to make it easier to find broken sensor later
    reset_array_data(acceleration_data, 3);
    reset_array_data(gyro_angular, 3);
    reset_array_data(magnetometer_data, 3);
    temperature = 0.0f;
    altitude = 0.0f;
    vertical_velocity = 0.0f;

    // ------------------------------------------------------------------------------------------------------ Get the sensor data
    // Get data from motors
    // Block until the motors allow to convert the value
    if(bdshot600_convert_all_responses()){
        // Motor 0 - BL, 1 - BR, 2 - FR, 3 - FL
        motor_frequency[0] = bdshot600_get_frequency(motor_BL);
        motor_frequency[1] = bdshot600_get_frequency(motor_BR);
        motor_frequency[2] = bdshot600_get_frequency(motor_FR);
        motor_frequency[3] = bdshot600_get_frequency(motor_FL);

