Rokasbarasa1/STM32-Quadcopter/src/main.c
        motor_rpm[0] = bdshot600_get_rpm(motor_BL); 
        motor_rpm[1] = bdshot600_get_rpm(motor_BR);
        motor_rpm[2] = bdshot600_get_rpm(motor_FR);
        motor_rpm[3] = bdshot600_get_rpm(motor_FL);
    }
    sensors2 = DWT->CYCCNT;

    // Disable interrupts as they heavily impact the i2c communication
    __disable_irq();
    temperature = bmp280_get_temperature_celsius();
    altitude = bmp280_get_height_centimeters_from_reference(0);
    sensors3 = DWT->CYCCNT;
    mmc5603_magnetometer_readings_micro_teslas(magnetometer_data);
    sensors4 = DWT->CYCCNT;
    mpu6050_get_accelerometer_readings_gravity(acceleration_data);
    mpu6050_get_gyro_readings_dps(gyro_angular);
    __enable_irq(); 

    sensors5 = DWT->CYCCNT;

    gps_latitude = bn357_get_latitude_decimal_format();
    gps_longitude = bn357_get_linear_longitude_decimal_format(); // Linear for pid
    gps_fix_type = bn357_get_fix_type();
    if(bn357_get_status_up_to_date(1)) got_gps = 1; // Flag for logging
    else got_gps = 0;
    if(gps_fix_type == 3) HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
    else HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    
    // Pitch (+)forwards - front of device nose goes down
    // Roll (+)right - the device banks to the right side while pointing forward
    // After yaw calculation yaw has to be 0/360 when facing north in the pitch+ axis
    // After getting roll and pitch from accelerometer. Pitch forwards -> +Pitch. Roll right -> +Roll
    rotate_magnetometer_output_90_degrees_anti_clockwise(magnetometer_data);
    invert_axies(acceleration_data);
    invert_axies(gyro_angular);
    // Pitch device forwards -> Y axis positive. Roll device right -> X axis positive

    // printf("%f;%f;%f;\n", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
    // ------------------------------------------------------------------------------------------------------ Filter the sensor data
    sensors6 = DWT->CYCCNT;

    // Notch filter: https://www.youtube.com/watch?v=ysS4bIXFAsU
    // Filtering rpm: https://www.youtube.com/watch?v=NCDyA9bnf4I&t=192s


    // Gyro RPM filtering
    // Filter the gyro using each of the rpm's from the motors
    // 4 notch filters with 3 harmonics



    // Gyro filtering is not needed as loop rate and gyro sample rate are the same
    magnetometer_data[0] = low_pass_filter_read(&filter_magnetometer_x, magnetometer_data[0]);
    magnetometer_data[1] = low_pass_filter_read(&filter_magnetometer_y, magnetometer_data[1]);
    magnetometer_data[2] = low_pass_filter_read(&filter_magnetometer_z, magnetometer_data[2]);

    // acceleration_data[0] = low_pass_filter_read(&filter_accelerometer_x, acceleration_data[0]);
    // acceleration_data[1] = low_pass_filter_read(&filter_accelerometer_y, acceleration_data[1]);
    // acceleration_data[2] = low_pass_filter_read(&filter_accelerometer_z, acceleration_data[2]);

    // ------------------------------------------------------------------------------------------------------ Sensor fusion
    calculate_roll_pitch_from_accelerometer_data(acceleration_data, &accelerometer_roll, &accelerometer_pitch, accelerometer_roll_offset, accelerometer_pitch_offset); // Get roll and pitch from the data. I call it x and y. Ranges -90 to 90. 
    sensor_fusion_roll_pitch(gyro_angular, accelerometer_roll, accelerometer_pitch, get_absolute_time(), 1, imu_orientation);

    // Sensor fusion imu degrees > accelerometer degrees
    calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data, &magnetometer_yaw, imu_orientation[0], imu_orientation[1], yaw_offset);

    // No need for sensor fusion, it introduces delay
    imu_orientation[2] = magnetometer_yaw;
    

    // GPS STUFF
    float latitude_sign = 1;
    if(bn357_get_latitude_direction() == 'N') latitude_sign = 1;
    else if(bn357_get_latitude_direction() == 'S') latitude_sign = -1;

    float longitude_sign = 1;
    if(bn357_get_longitude_direction() == 'E') longitude_sign = 1;
    else if(bn357_get_longitude_direction() == 'W') longitude_sign = -1;

    pitch_effect_on_lat = triangle_cos(imu_orientation[2] * (M_PI / 180.0)) * latitude_sign; // + GOOD, - GOOD  // If moving north forward positive, backwards negative
    roll_effect_on_lat = -triangle_cos(imu_orientation[2] * (M_PI / 180.0)) * latitude_sign; // + GOOD, - GOOD  // If moving north roll right positive, roll left south negative
    pitch_effect_on_lon = triangle_cos(imu_orientation[2] * (M_PI / 180.0)) * longitude_sign; // + GOOD, - GOOD 
    roll_effect_on_lon = triangle_cos(imu_orientation[2] * (M_PI / 180.0)) * longitude_sign; // GOOD, - GOOD

    sensors7 = DWT->CYCCNT;

    // printf("PLAT: %.2f RLAT: %.2f PLON: %.2f RLON: %.2f\n", 
    //     pitch_effect_on_lat,
    //     roll_effect_on_lat,
    //     pitch_effect_on_lon,
    //     roll_effect_on_lon,
    // );

    // Calculate the in between latitude and longitude to help derivative value
    // if(got_gps){
    //     // Calculate the rate of change of gps at it current refresh rate
    //     delta_gps_latitude = gps_latitude - old_gps_latitude;
    //     delta_gps_longitude = gps_longitude - old_gps_longitude;

    //     // Save the current gps values as old
    //     old_gps_latitude = gps_latitude;
    //     old_gps_longitude = gps_longitude;

    //     in_between_gps_latitude = gps_latitude;
    //     in_between_gps_longitude = gps_longitude;
    //     in_between_gps_loop_divider_counter = 0;
    // }else{
        
    //     // Sometimes the update is skipped on purpose
    //     if(in_between_gps_loop_divider_counter == in_between_gps_loop_divider){
    //         // Update the inbetween
    //         in_between_gps_latitude += delta_gps_latitude * (1.0f/REFRESH_RATE_HZ) * 10;
    //         in_between_gps_longitude += delta_gps_longitude * (1.0f/REFRESH_RATE_HZ) * 10; // Temp times 10 to signify the 10 hz refresh rate of gps

    //         in_between_gps_loop_divider_counter = 0;
    //     }else{
    //         in_between_gps_loop_divider_counter++;
    //     }

