Rokasbarasa1/STM32-Quadcopter/src/main.c
    //     // Apply the inbetween 
    //     gps_latitude = in_between_gps_latitude;
    //     gps_longitude = in_between_gps_longitude;
    // }


    // ------------------------------------------------------------------------------------------------------ Use sensor fused data for more data
    float vertical_acceleration[1] = {mpu6050_calculate_vertical_acceleration_cm_per_second(acceleration_data, imu_orientation)};
    float vertical_altitude[1] = {altitude};


    kalman_filter_predict(&altitude_and_velocity_kalman, vertical_acceleration);
    kalman_filter_update(&altitude_and_velocity_kalman, vertical_altitude);

    altitude = kalman_filter_get_state(&altitude_and_velocity_kalman)[0][0];
    vertical_velocity = kalman_filter_get_state(&altitude_and_velocity_kalman)[1][0];

    // printf("Alt %f vel %f ", altitude, vertical_velocity);
    // printf("IMU %f %f %f\n", imu_orientation[0], imu_orientation[1], imu_orientation[2]);
}



void handle_pid_and_motor_control(){    
    // For the robot to do work it needs to be receiving radio signals and at the correct angles, facing up
    if(
        imu_orientation[0] <  30 && 
        imu_orientation[0] > -30 && 
        imu_orientation[1] <  30 && 
        imu_orientation[1] > -30 && 
        ((float)get_absolute_time() - (float)last_signal_timestamp_microseconds) / 1000000.0 <= minimum_signal_timing_seconds
    ){
        // ---------------------------------------------------------------------------------------------- GPS position hold
        float gps_hold_roll_adjustment = 0.0f;
        float gps_hold_pitch_adjustment = 0.0f;
        if(use_gps_hold){
            if(gps_position_hold_enabled && got_gps){
                pid_set_desired_value(&gps_latitude_pid, target_latitude);
                pid_set_desired_value(&gps_longitude_pid, target_longitude);

                error_latitude = pid_get_error(&gps_latitude_pid, gps_latitude, get_absolute_time());
                error_longitude = pid_get_error(&gps_longitude_pid, gps_longitude, get_absolute_time());


                float gps_hold_roll_adjustment_calculation = roll_effect_on_lat * error_latitude + roll_effect_on_lon * error_longitude;
                float gps_hold_pitch_adjustment_calculation = pitch_effect_on_lat * error_latitude + pitch_effect_on_lon * error_longitude;


                // if(gps_hold_roll_adjustment_calculation > gps_pid_angle_of_attack_max){
                //     gps_hold_roll_adjustment_calculation = gps_pid_angle_of_attack_max;
                // }else if(gps_hold_roll_adjustment_calculation < -gps_pid_angle_of_attack_max){
                //     gps_hold_roll_adjustment_calculation = -gps_pid_angle_of_attack_max;
                // } 
            
                // if(gps_hold_pitch_adjustment_calculation > gps_pid_angle_of_attack_max){
                //     gps_hold_pitch_adjustment_calculation = gps_pid_angle_of_attack_max;
                // }else if(gps_hold_pitch_adjustment_calculation < -gps_pid_angle_of_attack_max){
                //     gps_hold_pitch_adjustment_calculation = -gps_pid_angle_of_attack_max;
                // }
                
                // gps_hold_roll_adjustment = gps_hold_roll_adjustment_integral + map_value(
                //     gps_hold_roll_adjustment_calculation, 
                //     -gps_pid_angle_of_attack_max, 
                //     gps_pid_angle_of_attack_max, 
                //     -pitch_attack_step, 
                //     pitch_attack_step
                // );

                // gps_hold_pitch_adjustment = gps_hold_pitch_adjustment_calculation + map_value(
                //     gps_hold_pitch_adjustment_calculation, 
                //     -gps_pid_angle_of_attack_max, 
                //     gps_pid_angle_of_attack_max, 
                //     -pitch_attack_step, 
                //     pitch_attack_step
                // );

                // if(gps_hold_roll_adjustment > gps_pid_angle_of_attack_max){
                //     gps_hold_roll_adjustment = gps_pid_angle_of_attack_max;
                // }else if(gps_hold_roll_adjustment < -gps_pid_angle_of_attack_max){
                //     gps_hold_roll_adjustment = -gps_pid_angle_of_attack_max;
                // }
                
                // if(gps_hold_pitch_adjustment > gps_pid_angle_of_attack_max){
                //     gps_hold_pitch_adjustment = gps_pid_angle_of_attack_max;
                // }else if(gps_hold_pitch_adjustment < -gps_pid_angle_of_attack_max){
                //     gps_hold_pitch_adjustment = -gps_pid_angle_of_attack_max;
                // }



                if(gps_hold_roll_adjustment_calculation > gps_pid_angle_of_attack_max){
                    gps_hold_roll_adjustment_calculation = gps_pid_angle_of_attack_max;
                }else if(gps_hold_roll_adjustment_calculation < -gps_pid_angle_of_attack_max){
                    gps_hold_roll_adjustment_calculation = -gps_pid_angle_of_attack_max;
                } 
            
                if(gps_hold_pitch_adjustment_calculation > gps_pid_angle_of_attack_max){
                    gps_hold_pitch_adjustment_calculation = gps_pid_angle_of_attack_max;
                }else if(gps_hold_pitch_adjustment_calculation < -gps_pid_angle_of_attack_max){
                    gps_hold_pitch_adjustment_calculation = -gps_pid_angle_of_attack_max;
                }

                gps_hold_roll_adjustment = gps_hold_roll_adjustment_calculation;
                gps_hold_pitch_adjustment = gps_hold_pitch_adjustment_calculation;
                
                // printf("%f;%f;%f;%f;%.2f;%.2f;%.2f;%.2f;%.2f;", target_latitude, target_longitude, gps_latitude, gps_longitude, gps_hold_roll_adjustment, gps_hold_pitch_adjustment, imu_orientation[0], imu_orientation[1], imu_orientation[2]);
                // printf("%.2f;%.2f;%.2f;%.2f;", roll_effect_on_lat, roll_effect_on_lon, pitch_effect_on_lat, pitch_effect_on_lon);
                // printf("\n");

                last_error_roll = gps_hold_roll_adjustment;
                last_error_pitch = gps_hold_pitch_adjustment;

