Rokasbarasa1/STM32-Quadcopter/src/main.c
                // printf("off: %3.1f %3.1f\n", gps_hold_roll_adjustment, gps_hold_pitch_adjustment);
            }else if(gps_position_hold_enabled && got_gps == 0){
                // Put in the same values'
                gps_hold_roll_adjustment = last_error_roll;
                gps_hold_pitch_adjustment = last_error_pitch;
            }
        }

        // ---------------------------------------------------------------------------------------------- Altitude hold
        if(use_vertical_velocity_control){
            pid_set_desired_value(&vertical_velocity_pid, target_vertical_velocity);
            error_vertical_velocity = pid_get_error(&vertical_velocity_pid, vertical_velocity, get_absolute_time());
        }else{
            error_vertical_velocity = 0;
        }

        // ---------------------------------------------------------------------------------------------- Angle mode
        if(use_angle_mode){
            pid_set_desired_value(&angle_roll_pid, angle_target_roll + gps_hold_roll_adjustment);
            pid_set_desired_value(&angle_pitch_pid, angle_target_pitch + gps_hold_pitch_adjustment);

            // For now not logging desired angle mode

            error_angle_roll = pid_get_error(&angle_roll_pid, imu_orientation[0], get_absolute_time());
            error_angle_pitch = pid_get_error(&angle_pitch_pid, imu_orientation[1], get_absolute_time());

        }else{
            error_angle_roll = 0;
            error_angle_pitch = 0;
        }

        // ---------------------------------------------------------------------------------------------- Acro mode
        if(use_angle_mode){
            pid_set_desired_value(&acro_roll_pid, error_angle_roll);
            pid_set_desired_value(&acro_pitch_pid, error_angle_pitch);
            pid_set_desired_value(&acro_yaw_pid, acro_target_yaw);
            
            PID_set_points[0] = error_angle_roll; // Logging
            PID_set_points[1] = error_angle_pitch; // Logging
            PID_set_points[2] = acro_target_yaw; // Logging
        }else{
            pid_set_desired_value(&acro_roll_pid, acro_target_roll);
            pid_set_desired_value(&acro_pitch_pid, acro_target_pitch);
            pid_set_desired_value(&acro_yaw_pid, acro_target_yaw);
            
            PID_set_points[0] = acro_target_roll; // Logging
            PID_set_points[1] = acro_target_pitch; // Logging
            PID_set_points[2] = acro_target_yaw; // Logging
        }


        error_acro_roll = pid_get_error(&acro_roll_pid, gyro_angular[0], get_absolute_time());
        error_acro_pitch = pid_get_error(&acro_pitch_pid, gyro_angular[1], get_absolute_time());
        error_acro_yaw = pid_get_error(&acro_yaw_pid, gyro_angular[2], get_absolute_time());

        PID_proportional[1] = pid_get_last_proportional_error(&acro_roll_pid); // Logging
        PID_integral[1] = pid_get_last_integral_error(&acro_roll_pid); // Logging
        PID_derivative[1] = pid_get_last_derivative_error(&acro_roll_pid); // Logging
        PID_proportional[0] = pid_get_last_proportional_error(&acro_pitch_pid); // Logging
        PID_integral[0] = pid_get_last_integral_error(&acro_pitch_pid); // Logging
        PID_derivative[0] = pid_get_last_derivative_error(&acro_pitch_pid); // Logging
        PID_proportional[2] = pid_get_last_proportional_error(&acro_yaw_pid); // Logging
        PID_integral[2] = pid_get_last_integral_error(&acro_yaw_pid); // Logging

        // ---------------------------------------------------------------------------------------------- Throttle
        error_throttle = throttle*0.9;

        // ---------------------------------------------------------------------------------------------- Applying to throttle to escs
        // motor_power[0] = ( error_acro_roll) + ( error_acro_pitch) + ( error_acro_yaw);
        // motor_power[1] = (-error_acro_roll) + ( error_acro_pitch) + (-error_acro_yaw);
        // motor_power[2] = (-error_acro_roll) + (-error_acro_pitch) + ( error_acro_yaw);
        // motor_power[3] = ( error_acro_roll) + (-error_acro_pitch) + (-error_acro_yaw);

        motor_power[0] = 0;
        motor_power[1] = 0;
        motor_power[2] = 0;
        motor_power[3] = 0;

        // For throttle control logic
        motor_power[0] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[1] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[2] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;
        motor_power[3] += error_throttle * (~use_vertical_velocity_control & 1) + error_vertical_velocity * use_vertical_velocity_control;

        // 2212
        // Motor B (0) 14460 rpm BL but should be BL
        // Motor C (1) 14160 rpm FL but should be BR
        // Motor D (2) 14460 rpm BR but should be FR
        // Motor A (3) 13740 rpm FR but should be FL
        throttle_value_FR = setServoActivationPercent(motor_power[2], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
        throttle_value_FL = setServoActivationPercent(motor_power[3], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
        throttle_value_BL = setServoActivationPercent(motor_power[0], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
        throttle_value_BR = setServoActivationPercent(motor_power[1], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);

        // FPV cam side FRONT
        bdshot600_set_throttle(throttle_value_FR, motor_FR); // Front-right
        bdshot600_set_throttle(throttle_value_FL, motor_FL); // Front-left
        // GPS side BACK
        bdshot600_set_throttle(throttle_value_BL, motor_BL); // Back-left
        bdshot600_set_throttle(throttle_value_BR, motor_BR); // Back-right


        // For logging
        motor_power[0] = throttle_value_BL; // Logging BL <- BL
        motor_power[1] = throttle_value_FL; // Logging FL <- FL
        motor_power[2] = throttle_value_BR; // Logging BR <- BR
        motor_power[3] = throttle_value_FR; // Logging FR <- FR
    }else{
        throttle_value_FR = min_dshot600_throttle_value;
        throttle_value_FL = min_dshot600_throttle_value;
        throttle_value_BL = min_dshot600_throttle_value;
        throttle_value_BR = min_dshot600_throttle_value;

        // FPV cam side FRONT
        bdshot600_set_throttle(throttle_value_FR, motor_FR); // Front-right
        bdshot600_set_throttle(throttle_value_FL, motor_FL); // Front-left
        // GPS side BACK
        bdshot600_set_throttle(throttle_value_BL, motor_BL); // Back-left
        bdshot600_set_throttle(throttle_value_BR, motor_BR); // Back-right


        // For logging
        motor_power[0] = throttle_value_BL; // Logging BL <- BL
        motor_power[1] = throttle_value_FL; // Logging FL <- FL
        motor_power[2] = throttle_value_BR; // Logging BR <- BR
        motor_power[3] = throttle_value_FR; // Logging FR <- FR

