Rokasbarasa1/STM32-Quadcopter/src/main.c
        // Reset the remote control set points also
        remote_control[0] = 0;
        remote_control[1] = 0;
        remote_control[2] = 0;
        remote_control[3] = 0;

        motor_power[0] = min_dshot600_throttle_value; // Logging
        motor_power[1] = min_dshot600_throttle_value; // Logging
        motor_power[2] = min_dshot600_throttle_value; // Logging
        motor_power[3] = min_dshot600_throttle_value; // Logging

        PID_proportional[0] = 0; // Logging
        PID_proportional[1] = 0; // Logging
        PID_proportional[2] = 0; // Logging

        PID_integral[0] = 0; // Logging
        PID_integral[1] = 0; // Logging
        PID_integral[2] = 0; // Logging

        PID_derivative[0] = 0; // Logging
        PID_derivative[1] = 0; // Logging

        PID_set_points[0] = 0; // Logging
        PID_set_points[1] = 0; // Logging
        PID_set_points[2] = 0; // Logging

        pid_reset_integral_sum(&acro_roll_pid);
        pid_reset_integral_sum(&acro_pitch_pid);
        pid_reset_integral_sum(&acro_yaw_pid);

        pid_reset_integral_sum(&angle_pitch_pid);
        pid_reset_integral_sum(&angle_roll_pid);

        pid_reset_integral_sum(&gps_longitude_pid);
        pid_reset_integral_sum(&gps_latitude_pid);
    }
}

void handle_radio_communication(){
    if(nrf24_data_available(1)){
        nrf24_receive(rx_data);
        // Get the type of request
        extract_request_type(rx_data, strlen(rx_data), rx_type);

        radio2 = DWT->CYCCNT;
        if(strcmp(rx_type, "js") == 0){
            // printf("JOYSTICK\n");
            last_signal_timestamp_microseconds = get_absolute_time();

            // extract_joystick_request_values_uint(rx_data, strlen(rx_data), &throttle, &yaw, &roll, &pitch);
            extract_joystick_request_values_float(rx_data, strlen(rx_data), &throttle, &yaw, &roll, &pitch);

            // Reversed
            roll = (-(roll-50.0))+50.0;

            // For the blackbox log
            remote_control[0] = roll;
            remote_control[1] = pitch-50.0;
            remote_control[2] = yaw-50.0;
            remote_control[3] = throttle+100.0;

            // the controls were inverse

            // If pitch and roll are neutral then try holding position with gps
            if(pitch == 50.0 && roll == 50.0 && gps_fix_type == 3 && use_gps_hold == 1 && gps_target_set == 0){
                gps_position_hold_enabled = 1;
                // Current gps position is the target now
                target_latitude = gps_latitude;
                target_longitude = gps_longitude;
                gps_target_set = 1;
                // printf("GPS STATE SET\n");
            }else if (pitch != 50.0 || roll != 50.0 ){
                if(use_gps_reset_count >= use_gps_reset_count_to_deactivate){
                    gps_position_hold_enabled = 0;
                    gps_target_set = 0;
                    // printf("GPS STATE RESET, GPS FIX %d\n", gps_fix_type);
                    use_gps_reset_count = 0;
                }else{
                    use_gps_reset_count++;
                }
            }

            // The remote control itself handles the deadband stuff

            // Roll ##################################################################################################################
            if(roll == 50.0){
                acro_target_roll = 0.0;
                angle_target_roll = 0.0;
            }else {
                acro_target_roll = map_value(roll, 0.0, 100.0, -acro_mode_rate_degrees_per_second, acro_mode_rate_degrees_per_second);
                angle_target_roll = map_value(roll, 0.0, 100.0, -max_roll_attack, max_roll_attack);
            }
            // Pitch ##################################################################################################################
            if(pitch == 50.0){
                acro_target_pitch = 0.0;
                angle_target_pitch = 0.0;
            }else{   
                acro_target_pitch = map_value(pitch, 0.0, 100.0, -acro_mode_rate_degrees_per_second, acro_mode_rate_degrees_per_second);
                angle_target_pitch = map_value(pitch, 0.0, 100.0, -max_pitch_attack, max_pitch_attack);
            }


            // Yaw ##################################################################################################################
            if(yaw == 50) acro_target_yaw = 0;
            else acro_target_yaw = map_value(yaw, 0.0, 100.0, -max_yaw_attack, max_yaw_attack);

            // Throttle ##################################################################################################################
            target_vertical_velocity = map_value(throttle, 0, 100, -max_throttle_vertical_velocity, max_throttle_vertical_velocity);




        }else if(strcmp(rx_type, "pid") == 0){
            printf("\nGot pid");
            
            float added_proportional = 0;
            float added_integral = 0;
            float added_derivative = 0;
            float added_master_gain = 0;

            extract_pid_request_values(rx_data, strlen(rx_data), &added_proportional, &added_integral, &added_derivative, &added_master_gain);

            
            if(!use_angle_mode){ // ACRO MODE
                acro_roll_pitch_gain_p = BASE_ACRO_roll_pitch_GAIN_P + added_proportional;
                acro_roll_pitch_gain_i = BASE_ACRO_roll_pitch_GAIN_I + added_integral;
                acro_roll_pitch_gain_d = BASE_ACRO_roll_pitch_GAIN_D + added_derivative;
                acro_roll_pitch_master_gain = BASE_ACRO_roll_pitch_MASTER_GAIN + added_master_gain;


                // Configure the roll pid 
                pid_set_proportional_gain(&acro_roll_pid, acro_roll_pitch_gain_p * acro_roll_pitch_master_gain);
                pid_set_integral_gain(&acro_roll_pid, acro_roll_pitch_gain_i * acro_roll_pitch_master_gain);
                pid_set_derivative_gain(&acro_roll_pid, acro_roll_pitch_gain_d * acro_roll_pitch_master_gain);
                pid_reset_integral_sum(&acro_roll_pid);

                // Configure the pitch pid 
                pid_set_proportional_gain(&acro_pitch_pid, acro_roll_pitch_gain_p * acro_roll_pitch_master_gain);
                pid_set_integral_gain(&acro_pitch_pid, acro_roll_pitch_gain_i * acro_roll_pitch_master_gain);
                pid_set_derivative_gain(&acro_pitch_pid, acro_roll_pitch_gain_d * acro_roll_pitch_master_gain);
                pid_reset_integral_sum(&acro_pitch_pid);
            }

            if(use_angle_mode){ // ANGLE MODE
                angle_roll_pitch_gain_p = BASE_ANGLE_roll_pitch_GAIN_P + added_proportional;
                angle_roll_pitch_gain_i = BASE_ANGLE_roll_pitch_GAIN_I + added_integral;
                angle_roll_pitch_gain_d = BASE_ANGLE_roll_pitch_GAIN_D + added_derivative;
                angle_roll_pitch_master_gain = BASE_ANGLE_roll_pitch_MASTER_GAIN + added_master_gain;

